import logging
from telegram import InlineKeyboardButton, InlineKeyboardMarkup
from telegram.ext import Application, CommandHandler, CallbackQueryHandler, ContextTypes

# Налаштування логування
logging.basicConfig(
    format='%(asctime)s - %(name)s - %(levelname)s - %(message)s',
    level=logging.INFO
)
logger = logging.getLogger(__name__)

# Розклад для кожного класу
schedule = {
    '5-А': {
        'Понеділок': ['📚 Англійська мова', '📈 Математика', '🎶 Музика', '📘 Українська мова', '🏰 Основи здоров’я', '🌍 Німецька мова'],
        'Вівторок': ['📚 Англійська мова', '📈 Математика', '🏃 Фізичне виховання', '📘 Українська мова', '🎨 Образотворче мистецтво', '📘 Українська література'],
        'Середа': ['Інформатика (1 група), Інформатика (2 група)', '📘 Українська мова', '📚 Англійська мова', '📈 Математика', '🌍 Природа', '💖 Зарубіжна література'],
        'Четвер': ['🔧 Технології', '📚 Історія', '📚 Англійська мова', '📘 Українська мова або Етика', '💖 Зарубіжна література', '🏃 Фізичне виховання', '📘 Українська література'],
        'П’ятниця': ['🌍 Природа', '📈 Математика', '📚 Англійська мова', '📘 Українська мова', '🌍 Німецька мова', '🏃 Фізичне виховання']
    },
    '5-Б': {
        'Понеділок': ['📘 Українська мова', '📘 Українська література', '📈 Математика', '🎶 Музика', '🏃 Фізичне виховання', '📈 Математика'],
        'Вівторок': ['📚 Англійська мова', '🔧 Технології', '📈 Математика', '📘 Українська мова', '🏃 Фізичне виховання', '📚 Історія'],
        'Середа': ['🔬 STEM', '🖥️ Інформатика (1 група), Інформатика (2 група)', '🔧 Технології', '📚 Англійська мова або Етика', '🎭 Драмат', '🌍 Природа', '💖 Зарубіжна література'],
        'Четвер': ['📚 Англійська мова', '📈 Математика', '📘 Українська мова', '💖 Зарубіжна література', '🎨 Образотворче мистецтво', '📈 Математика'],
        'П’ятниця': ['📘 Українська мова', '🏃 Фізичне виховання', '📚 Англійська мова', '🌍 Природа', '📘 Українська література', '🏰 Основи здоров’я']
    },
    '6-А': {
        'Понеділок': ['🌍 Англійська мова (1 група), Англійська мова (2 група)', '📈 Математика', '📈 Математика', '📚 Історія', '📚 Історія', '🌍 Природа', '💖 Зарубіжна література'],
        'Вівторок': ['🌍 Географія', '🏃 Фізичне виховання', '🎭 Драмат', '💖 Зарубіжна література', '📘 Українська мова (2 група), Українська мова (1 група)', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📈 Математика'],
        'Середа': ['🌍 Географія', '📘 Українська мова (1 група), Німецька мова (2 група)', '🖥️ Інформатика (1 група), Інформатика (2 група)', '📘 Українська мова (2 група), Німецька мова (1 група)', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '🏃 Фізичне виховання'],
        'Четвер': ['🎶 Музика або Мистецтво', '🎨 Образотворче мистецтво або Технології (1 група, 2 група)', '🔧 Технології (1 група), Технології (2 група)', '📘 Українська література', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📘 Українська мова (2 група), Українська мова (1 група)', '🏃 Фізичне виховання'],
        'П’ятниця': ['📘 Українська мова (1 група), Німецька мова (2 група)', '📘 Українська мова (2 група), Німецька мова (1 група)', '🌍 Природа', '📈 Математика', '🏰 Основи здоров’я', '📘 Українська література', '🌍 Англійська мова (1 група), Англійська мова (2 група)']
    },
    '6-Б': {
        'Понеділок': ['📈 Математика', '📚 Історія', '🏰 Основи здоров’я', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📘 Українська мова (2 група), Українська мова (1 група)', '🌿 Природа'],
        'Вівторок': ['🔬 STEM', '🌍 Географія', '🔧 Технології (1 група, 2 група)', '📘 Українська література', '📘 Українська мова (2 група), Українська мова (1 група)', '🏃 Фізичне виховання'],
        'Середа': ['📘 Українська мова (2 група), Українська мова (1 група)', '📈 Математика', '🏃 Фізичне виховання', '🌍 Англійська мова (1 група), 🖥️ Інформатика (2 група)', '🌍 Географія', '🖥️ Інформатика (1 група), 🌍 Англійська мова (2 група)', '💖 Зарубіжна література або 🖥️ Інформатика (1 група, 2 група)'],
        'Четвер': ['📈 Математика', '💖 Українська література', '🏃 Фізичне виховання', '📚 Історія', '🎶 Музика', '🌍 Англійська мова (1 група), 🌍 Англійська мова (2 група)', '🎭 Драмат'],
        'П’ятниця': ['📈 Математика', '🌿 Природа', '📘 Українська мова (2 група), 📘 Українська мова (1 група)', '💖 Зарубіжна література', '🎨 Образотворче мистецтво', '📈 Математика']
    },
    '7-А': {
        'Понеділок': ['🌍 Географія', '📘 Українська мова (2 група), Німецька мова (1 група)', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📘 Українська мова (1 група), Німецька мова (2 група)', '📘 Українська мова (2 група), Українська мова (1 група)', '🌱 Біологія', '📊 Геометрія'],
        'Вівторок': ['🏃 Фізичне виховання', '📘 Фізика', '🌱 Біологія', '🧪 Хімія', '💖 Зарубіжна література', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '🎭 Драматика'],
        'Середа': ['📊 Алгебра', '🏃 Фізичне виховання', '🌍 Географія', '🎨 Образотворче мистецтво', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📘 Українська література', '🎶 Мистецтво'],
        'Четвер': ['🖥️ Інформатика (1 група), Інформатика (2 група)', '📊 Геометрія', '📘 Фізика', '🏃 Фізичне виховання', '🌍 Англійська мова (1 група), Англійська мова (2 група)', '📘 Українська мова (1/2)', '📚 Історія України'],
        'П’ятниця': ['📚 Всесвітня історія', '💖 Зарубіжна література або 📘 Українська література', '📘 Українська мова (2 група), Німецька мова (1 група)', '📘 Українська мова (1 група), Німецька мова (2 група)', '📊 Алгебра', '🔧 Технології (1 група, 2 група)', '🏰 Основи здоров’я']
    },
    '7-Б': {
        'Понеділок': ['🧪 Хімія', '🌍 Географія', '🌱 Біологія', '🏃 Фізичне виховання', '📊 Алгебра', '💖 Зарубіжна література', '🎨 Мистецтво'],
        'Вівторок': ['📘 Фізика', '🏃 Фізичне виховання', '📚 Історія України', '🌍 Англійська мова (1 група), 📘 Українська мова (2 група)', '🌍 Англійська мова (2 група), 📘 Українська мова (1 група)', '📊 Геометрія', '🌍 Англійська мова (1/2) або 💖 Зарубіжна література'],
        'Середа': ['🌍 Англійська мова (1 група), 📘 Українська мова (2 група)', '🌍 Англійська мова (2 група), 📘 Українська мова (1 група)', '📊 Алгебра', '🌍 Географія', '📘 Українська література', '🔧 Технології (1 група, 2 група)', '🔧 Технології (1/2)'],
        'Четвер': ['🌱 Біологія', '🖥️ Інформатика (1/2)', '📊 Алгебра', '📘 Фізика', '📊 Геометрія', '📘 Українська література', '🖥️ Інформатика або 🔬 STEM'],
        'П’ятниця': ['🌍 Англійська мова (1 група), 📘 Українська мова (2 група)', '🌍 Англійська мова (2 група), 📘 Українська мова (1 група)', '🏃 Фізичне виховання', '🎨 Образотворче мистецтво', '🏰 Основи здоров’я', '🎭 Драмат', '📚 Всесвітня історія']
    },
    '8-А': {
        'Понеділок': ['📘 Українська мова (№1), німецька мова (№2)', '📘 Фізика', '💖 Зарубіжна література', '🌍 Географія', '🌍 Англійська мова (№1), англійська мова (№2)', '🌍 Англійська мова (№1), англійська мова (№2)', '📘 Українська мова (№2), німецька мова (№1)'],
        'Вівторок': ['📊 Алгебра', '📚 Всесвітня історія', '📊 Геометрія', '🏃 Фізичне виховання', '🌱 Біологія', '🧪 Хімія', '🏰 Основи здоров’я'],
        'Середа': ['📘 Українська література', '📊 Алгебра', '📘 Українська мова (1 група), німецька мова (2 група)', '🌍 Англійська мова (1 група), англійська мова (2 група)', '📘 Українська мова (2 група), німецька мова (1 група)', '📊 Геометрія', '🏃 Фізичне виховання'],
        'Четвер': ['📘 Фізика', '🌍 Англійська мова (1 група), англійська мова (2 група)', '🖥️ Інформатика (1 група), інформатика (2 група)', '🌱 Біологія', '🌍 Географія', '🏃 Фізичне виховання', '💖 Зарубіжна література'],
        'П’ятниця': ['🖥️ Інформатика (1 група), інформатика (2 група)', '📚 Історія України або 🧪 Хімія', '📚 Історія України', '🧪 Хімія', '📘 Українська література', '🌍 Англійська мова (1 група), англійська мова (2 група)', '🔧 Технології (1 група), технології (2 група)']
    },
    '8-Б': {
        'Понеділок': ['🛐 Етика', '🧪 Хімія', '📊 Алгебра', '📊 Геометрія', '🌍 Географія', '🌍 Англійська мова (1 група), англійська мова (2 група)', '📘 Українська література'],
        'Вівторок': ['📘 Українська мова (1 група), англійська мова (2 група)', '📘 Українська мова (2 група), англійська мова (1 група)', '🏃 Фізичне виховання', '📚 Всесвітня історія', '🧪 Хімія', '🔧 Технології (1 група), технології (2 група)', '📚 Історія України'],
        'Середа': ['🏃 Фізичне виховання', '🌱 Біологія', '📘 Українська література', '💖 Зарубіжна література', '📊 Алгебра', '🎨 Мистецтво', '🏰 Основи здоров’я'],
        'Четвер': ['📘 Українська мова (2 група), англійська мова (1 група)', '📘 Українська мова (1 група), англійська мова (2 група)', '📘 Фізика', '🖥️ Інформатика (1 група), інформатика (2 група)', '🏃 Фізичне виховання', '🌍 Географія', '🌱 Біологія'],
        'П’ятниця': ['📊 Геометрія', '🖥️ Інформатика (1 група), інформатика (2 група)', '📘 Фізика', '📚 Історія України', '💖 Зарубіжна література', '📘 Фізика', '📘 Українська мова']
    },
    '9-А': {
        'Понеділок': ['🏃 Фізичне виховання', '💖 Зарубіжна література', '📊 Геометрія', '🌱 Біологія', '🌍 Німецька мова', '📘 Українська література', '📘 Фізика'],
        'Вівторок': ['🖥️ Інформатика (1 група), інформатика (2 група)', '📚 Історія', '🌍 Географія', '⚖️ Право', '🌍 Англійська мова', '📘 Фізика', '📘 Фізика'],
        'Середа': ['🌱 Біологія', '📊 Алгебра', '📊 Геометрія', '🧪 Хімія', '💖 Зарубіжна література', '📘 Українська мова', '🌍 Англійська мова'],
        'Четвер': ['📚 Історія', '🎨 Мистецтво', '📘 Українська мова', '📚 Історія або 🌍 Географія', '🖥️ Інформатика (1 група), інформатика (2 група)', '🔧 Технології', '🏃 Фізичне виховання'],
        'П’ятниця': ['🏃 Фізичне виховання', '🌍 Англійська мова', '🧪 Хімія', '📊 Алгебра', '🌍 Англійська мова', '🌍 Німецька мова', '📘 Українська література', '🏰 Основи здоров’я']
    },
    '9-Б': {
        'Понеділок': ['📚 Всесвітня історія', '🌍 Англійська мова', '📚 Історія України або 🌍 Географія', '📘 Фізика', '🌱 Біологія', '🎨 Мистецтво', '🏃 Фізичне виховання'],
        'Вівторок': ['📊 Алгебра', '🖥️ Інформатика (1 група), інформатика (2 група)', '📘 Українська мова', '🌍 Географія', '📊 Геометрія', '💖 Зарубіжна література', '📘 Українська література'],
        'Середа': ['📊 Алгебра', '💖 Зарубіжна література', '🛐 Етика', '🌱 Біологія', '⚖️ Право', '🧪 Хімія', '📚 Історія України'],
        'Четвер': ['📘 Фізика', '📊 Геометрія', '🏰 Основи здоров’я', '🌍 Англійська мова', '📘 Фізика', '🖥️ Інформатика (1 група), інформатика (2 група)', '📘 Українська мова', '🏃 Фізичне виховання'],
        'П’ятниця': ['🧪 Хімія', '🔧 Технології', '🌍 Англійська мова', '📘 Українська література', '🏃 Фізичне виховання', '💊 Медицина', '💊 Медицина']
    },
    '10-А': {
        'Понеділок': ['🖥️ Інформатика (1 група), інформатика (2 група)', '🛡️ Гром.ОС', '📘 Фізика', '🧪 Хімія', '📊 Геометрія', '🏃 Фізичне виховання', '📘 Українська література'],
        'Вівторок': ['📚 Історія', '📘 Українська мова', '🌍 Англійська мова', '🌍 Англійська мова', '📚 Історія або 🌍 Географія', '🌱 Біологія', '🔧 Технології'],
        'Середа': ['🌍 Німецька мова', '📘 Українська література', '🛡️ Grom.os', '📊 Алгебра', '🔧 Технології', '🌍 Німецька мова', '🌍 Англійська мова'],
        'Четвер': ['📘 Українська мова', '📚 Історія', '🌍 Географія', '📊 Геометрія', '📘 Фізика', '🌱 Біологія', '🏃 Фізичне виховання'],
        'П’ятниця': ['🛡️ Захист України', '🌍 Англійська мова', '🧪 Хімія або 🛡️ Захист України', '🌍 Англійська мова', '📘 Фізика', '💖 Зарубіжна література', '🏃 Фізичне виховання']
    },
    '10-Б': {
        'Понеділок': ['🖥️ Інформатика (1 група), інформатика (2 група)', '🛡️ GROM.os', '📊 Геометрія', '📘 Фізика', '🏃 Фізичне виховання', '🌱 Біологія'],
        'Вівторок': ['🌱 Біологія', '📊 Алгебра', '💖 Зарубіжна література', '📘 Українська мова', '🏃 Фізичне виховання'],
        'Середа': ['🌍 Англійська мова', '📘 Фізика', '🧪 Хімія', '📚 Історія України', '🎨 Мистецтво', '🌍 Географія або 📚 Історія України', '📚 Всесвітня історія'],
        'Четвер': ['📊 Геометрія', '🌍 Географія', '📘 Українська література', '📘 Фізика', '🛡️ GROM.os', '📘 Фізика', '🌍 Англійська мова'],
        'П’ятниця': ['🏃 Фізичне виховання', '📘 Українська мова', '🖥️ Інформатика (1 група), інформатика (2 група)', '🧪 Хімія або 🛡️ Захист України', '📘 Українська література', '🛡️ Захист України', '💖 Зарубіжна література']
    },
    '11-А': {
        'Понеділок': ['🖥️ Інформатика', '🌱 Біологія', '🏃 Фізичне виховання', '📘 Фізика', '🧪 Хімія', '📚 Всесвітня історія', '🌍 Географія', '🖥️ Інформатика (2 група)'],
        'Вівторок': ['🖥️ Інформатика (2 група)', '📘 Українська мова', '📘 Українська література', '🌱 Біологія', '🌍 Англійська мова', '🏃 Фізичне виховання', '🌍 Англійська мова', '🖥️ Інформатика (1 група)'],
        'Середа': ['🌍 Англійська мова', '🛡️ Захист України або 📚 Історія України', '🛡️ Захист України', '🧪 Хімія', '📊 Алгебра', '🌌 Астрономія', '🌍 Німецька мова'],
        'Четвер': ['📚 Історія України', '📘 Фізика', '💖 Зарубіжна література', '🌍 Англійська мова', '📘 Українська мова', '📊 Геометрія'],
        'П’ятниця': ['🔧 Технології', '📊 Геометрія', '🏃 Фізичне виховання', '📘 Фізика', '🌍 Англійська мова', '📘 Українська література', '🌍 Німецька мова']
    },
    '11-Б': {
        'Понеділок': [
            '🌱 Біологія',
            '🎨 Мистецтво',
            '🧪 Хімія',
            '💖 Зарубіжна література',
            '🏃 Фізичне виховання',
            '📘 Фізика'
        ],
        'Вівторок': [
            '📘 Українська мова',
            '🌍 Англійська мова',
            '📊 Математика',
            '🌍 Англійська мова',
            '📚 Історія України',
            '📘 Українська література',
            '🌍 Географія'
        ],
        'Середа': [
            '🛡️ Захист України',
            '🧪 Хімія',
            '📘 Українська мова',
            '📘 Фізика',
            '🌌 Астрономія',
            '📚 Історія України або 🛡️ Захист України',
            '📘 Українська література'
        ],
        'Четвер': [
            '🖥️ Інформатика',
            '🌱 Біологія',
            '🎨 Мистецтво',
            '📊 Математика',
            '📘 Українська мова',
            '📚 Всесвітня історія'
        ],
        'П’ятниця': [
            '📘 Фізика',
            '🏃 Фізичне виховання',
            '💖 Зарубіжна література',
            '🏃 Фізичне виховання',
            '📊 Математика',
            '📚 Історія України',
            '🧪 Хімія'
        ]
    }
}

# Функція для старту бота
# Функція для старту бота
async def start(update, context: ContextTypes.DEFAULT_TYPE):
    # Створюємо клавіатуру з двома стовпчиками
    keyboard = []
    keys = list(schedule.keys())
    for i in range(0, len(keys), 2):
        # Додаємо два класи в один рядок, якщо є достатньо елементів
        if i + 1 < len(keys):
            keyboard.append([
                InlineKeyboardButton(keys[i], callback_data=f'class_{keys[i]}'),
                InlineKeyboardButton(keys[i+1], callback_data=f'class_{keys[i+1]}')
            ])
        else:
            keyboard.append([InlineKeyboardButton(keys[i], callback_data=f'class_{keys[i]}')])

    reply_markup = InlineKeyboardMarkup(keyboard)
    await update.message.reply_text('Оберіть свій клас:', reply_markup=reply_markup)

# Функція для вибору дня тижня
async def select_day(update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    class_selected = query.data.split('_')[1]
    context.user_data['class_selected'] = class_selected  # Збереження обраного класу
    days_keyboard = [[InlineKeyboardButton(day, callback_data=f'day_{day}')] for day in schedule[class_selected].keys()]
    days_keyboard.append([InlineKeyboardButton('🔙 Назад', callback_data='back_to_class')])  # Додаємо кнопку "Назад"
    reply_markup = InlineKeyboardMarkup(days_keyboard)
    await query.edit_message_text(f'Ви обрали {class_selected}. Оберіть день тижня:', reply_markup=reply_markup)
    await query.answer()


# Функція для показу розкладу
async def show_schedule(update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    day_selected = query.data.split('_')[1]
    class_selected = context.user_data['class_selected']
    lessons = schedule[class_selected].get(day_selected, [])
    schedule_text = f'📅 Розклад на {day_selected} для {class_selected}:\n' + '\n'.join(
        [f'🕒 {i+1}. {lesson}' for i, lesson in enumerate(lessons)]
    )
    days_keyboard = [
        [InlineKeyboardButton(day, callback_data=f'day_{day}')]
        for day in schedule[class_selected].keys()
    ]
    days_keyboard.append([InlineKeyboardButton('🔙 Назад', callback_data='back_to_days')])  # Додаємо кнопку "Назад"
    reply_markup = InlineKeyboardMarkup(days_keyboard)
    await query.edit_message_text(schedule_text, reply_markup=reply_markup)
    await query.answer()


# Функція для повернення назад до вибору класу
# Функція для повернення назад до вибору класу
async def go_back_to_class(update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    # Створюємо клавіатуру з двома стовпчиками
    keyboard = []
    keys = list(schedule.keys())
    for i in range(0, len(keys), 2):
        # Додаємо два класи в один рядок, якщо є достатньо елементів
        if i + 1 < len(keys):
            keyboard.append([
                InlineKeyboardButton(keys[i], callback_data=f'class_{keys[i]}'),
                InlineKeyboardButton(keys[i+1], callback_data=f'class_{keys[i+1]}')
            ])
        else:
            keyboard.append([InlineKeyboardButton(keys[i], callback_data=f'class_{keys[i]}')])

    reply_markup = InlineKeyboardMarkup(keyboard)
    await query.edit_message_text('Оберіть свій клас:', reply_markup=reply_markup)
    await query.answer()


# Функція для повернення назад до вибору дня
async def go_back_to_days(update, context: ContextTypes.DEFAULT_TYPE):
    query = update.callback_query
    class_selected = context.user_data['class_selected']
    days_keyboard = [[InlineKeyboardButton(day, callback_data=f'day_{day}')] for day in schedule[class_selected].keys()]
    days_keyboard.append([InlineKeyboardButton('🔙 Назад', callback_data='back_to_class')])
    reply_markup = InlineKeyboardMarkup(days_keyboard)
    await query.edit_message_text(f'Ви обрали {class_selected}. Оберіть день тижня:', reply_markup=reply_markup)
    await query.answer()

# Основна функція для запуску бота
def main():
    application = Application.builder().token('7607176658:AAH2RRiygERcihN52navdVeawajhKaw2WJw').build()

    # Додавання хендлерів
    application.add_handler(CommandHandler('start', start))
    application.add_handler(CallbackQueryHandler(select_day, pattern='class_'))
    application.add_handler(CallbackQueryHandler(show_schedule, pattern='day_'))
    application.add_handler(CallbackQueryHandler(go_back_to_class, pattern='back_to_class'))
    application.add_handler(CallbackQueryHandler(go_back_to_days, pattern='back_to_days'))

    # Запуск бота
    application.run_polling()

if __name__ == '__main__':
    main()

import os

def main():
    token = os.environ.get('TELEGRAM_BOT_TOKEN')
    application = Application.builder().token(token).build()
    # Ваш інший код тут


